app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = @artist.songs
    else
      @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def set_artist
   if params[:artist_id]
     @artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]